blogs/diskio-troubleshooting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-02 六 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>定位磁盘IO问题</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">定位磁盘IO问题</h1>
<p>
*
</p>

<div id="outline-container-org52c8a1d" class="outline-2">
<h2 id="org52c8a1d"><span class="section-number-2">1</span> 磁盘write吞吐饱和的表现</h2>
<div class="outline-text-2" id="text-1">
<p>
磁盘write会先写page cache，page cache标记为Dirty（不可直接回收），然后由kswapd进程把page cache写入磁盘，page cache标记为Clean（可回收）。
</p>

<p>
如果write吞吐饱和，Dirty page的数量（大小）会较大，或持续上升。
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#29289;&#29702;&#26426;&#26597;&#30475;</span>
<span style="color: #00ffff;">for</span> ((<span style="color: #eedd82;">i</span>=0; i&lt;100; i++)); <span style="color: #00ffff;">do </span><span style="color: #b0c4de;">echo</span> $(<span style="color: #fa8072;">date</span> +%T) $(<span style="color: #fa8072;">cat</span> /proc/meminfo | grep Dirty); <span style="color: #00ffff;">done</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#23481;&#22120;&#26597;&#30475;</span>
<span style="color: #00ffff;">for</span> ((<span style="color: #eedd82;">i</span>=0; i&lt;100; i++)); <span style="color: #00ffff;">do </span><span style="color: #b0c4de;">echo</span> $(<span style="color: #fa8072;">date</span> +%T) $(<span style="color: #fa8072;">cat</span> /sys/fs/cgroup/memory/memory.stat | grep <span style="color: #ffa07a;">"^dirty"</span>); <span style="color: #00ffff;">done</span>
</pre>
</div>

<p>
磁盘通常是读优先，可以通过wbt配置，调整写的优先级。
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">sdb &#26159;&#30456;&#24212;&#30340;&#30913;&#30424;&#65292;&#21487;&#29992;&#36890;&#36807;df&#26597;&#30475;</span>
cat /sys/block/sdb/queue/wbt_lat_usec
75000

<span style="color: #b0c4de;">echo</span> 0 | sudo tee /sys/block/sdb/queue/wbt_lat_usec
</pre>
</div>

<p>
下面两个参数，控制dirty page的写入
</p>
<pre class="example">
# dirty page 存在超过30S，会写入磁盘
vm.dirty_expire_centisecs = 3000

# dirty page的大小超过available内存的20%，开始写入磁盘
vm.dirty_ratio = 20
</pre>
</div>
</div>

<div id="outline-container-org40c3088" class="outline-2">
<h2 id="org40c3088"><span class="section-number-2">2</span> 找到IO高的进程</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>BCC的filetop查看机器的IO，可以找到高IO的线程（ <code>ps -eLf | grep &lt;tid&gt;</code> 查找进程），以及对应的文件;</li>
<li>iotop也可以完成类似的工作。</li>
</ol>
</div>
</div>

<div id="outline-container-orgdd4bad4" class="outline-2">
<h2 id="orgdd4bad4"><span class="section-number-2">3</span> 查看IO的延迟情况</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>BCC的fileshower、ext4shower、xfsshower可以查看IO延迟低于某个阈值的操作;</li>
<li>BCC的funclatency可用跟踪 <code>vfs_read、vfs_write</code> 查看IO延迟的分布。</li>
</ol>
</div>
</div>

<div id="outline-container-org29f8144" class="outline-2">
<h2 id="org29f8144"><span class="section-number-2">4</span> 查看IO设备的延迟情况</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>BCC的biolatency可以查看设备的延迟情况;</li>
<li>blktrace -d &lt;device&gt; 可以跟踪设备的操作。</li>
</ol>
</div>
</div>

<div id="outline-container-orgdfe3a58" class="outline-2">
<h2 id="orgdfe3a58"><span class="section-number-2">5</span> 定位IO延迟高的根因</h2>
<div class="outline-text-2" id="text-5">
<p>
IO延迟高通常有如下原因：
</p>
<ol class="org-ol">
<li>内存不足，pagecache的命中率低，可以使用BCC的cachestat查看;</li>
<li>磁盘IO到瓶颈了（可能由业务异常导致高IO），dirty page的大小可以用于判断写是否饱和;</li>
<li>硬件BUG，可能是固件的BUG，例如ssd硬盘的gc算法等;</li>
<li>软件BUG，软件非预期的行为，例如：用fadvise64清除了文件的缓存。</li>
</ol>

<p>
使用fio压测，看硬件的性能是否和标注的性能差异较大。
</p>
</div>
</div>

<div id="outline-container-orgbcae3be" class="outline-2">
<h2 id="orgbcae3be"><span class="section-number-2">6</span> 其它指标</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>cpu的iowait衡量因为io处于idle的时间，但没有明确的阈值;</li>
<li>iostat的IO数量、IO大小、IO排队，但也没有明确的阈值。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-12-02 六 10:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
